In [11]:
import pandas as pd

In [12]:
temp_df = pd.read_csv("./Data/GlobalLandTemperaturesByCity.csv")
temp_df.head(50)

,dt,AverageTemperature,AverageTemperatureUncertainty,City,Country,Latitude,Longitude
0,1743-11-01,6.068,1.737,Århus,Denmark,57.05N,10.33E
1,1743-12-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
2,1744-01-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
3,1744-02-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
4,1744-03-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
5,1744-04-01,5.788,3.624,Århus,Denmark,57.05N,10.33E
6,1744-05-01,10.644,1.283,Århus,Denmark,57.05N,10.33E
7,1744-06-01,14.051,1.347,Århus,Denmark,57.05N,10.33E
8,1744-07-01,16.082,1.396,Århus,Denmark,57.05N,10.33E
9,1744-08-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
10,1744-09-01,12.781,1.454,Århus,Denmark,57.05N,10.33E
11,1744-10-01,7.950,1.630,Århus,Denmark,57.05N,10.33E
12,1744-11-01,4.639,1.302,Århus,Denmark,57.05N,10.33E
13,1744-12-01,0.122,1.756,Århus,Denmark,57.05N,10.33E
14,1745-01-01,-1.333,1.642,Århus,Denmark,57.05N,10.33E
15,1745-02-01,-2.732,1.358,Århus,Denmark,57.05N,10.33E
16,1745-03-01,0.129,1.088,Århus,Denmark,57.05N,10.33E
17,1745-04-01,4.042,1.138,Århus,Denmark,57.05N,10.33E
18,1745-05-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
19,1745-06-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
20,1745-07-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
21,1745-08-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
22,1745-09-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
23,1745-10-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
24,1745-11-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
25,1745-12-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
26,1746-01-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
27,1746-02-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
28,1746-03-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
29,1746-04-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
30,1746-05-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
31,1746-06-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
32,1746-07-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
33,1746-08-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
34,1746-09-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
35,1746-10-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
36,1746-11-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
37,1746-12-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
38,1747-01-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
39,1747-02-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
40,1747-03-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
41,1747-04-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
42,1747-05-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
43,1747-06-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
44,1747-07-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
45,1747-08-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
46,1747-09-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
47,1747-10-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
48,1747-11-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
49,1747-12-01,NaN,NaN,Århus,Denmark,57.05N,10.33E

In [25]:
temp_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8599212 entries, 0 to 8599211
Data columns (total 7 columns):
 #   Column                         Dtype
---  ------                         -----
 0   dt                             object
 1   AverageTemperature             float64
 2   AverageTemperatureUncertainty  float64
 3   City                           object
 4   Country                        object
 5   Latitude                       object
 6   Longitude                      object
dtypes: float64(2), object(5)
memory usage: 459.2+ MB

In [34]:
temp_df["Country"].nunique()

159

In [14]:
emis_df = pd.read_csv("./Data/TotalGHGEmissions.csv")
emis_df.head()

        Entity Code  Year  Total GHG emissions including LUCF (CAIT)
0  Afghanistan  AFG  1990                                 15140000.0
1  Afghanistan  AFG  1991                                 15060000.0
2  Afghanistan  AFG  1992                                 13600000.0
3  Afghanistan  AFG  1993                                 13430000.0
4  Afghanistan  AFG  1994                                 13240000.0

In [26]:
emis_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5208 entries, 0 to 5207
Data columns (total 4 columns):
 #   Column                                     Non-Null Count  Dtype
---  ------                                     --------------  -----
 0   Entity                                     5208 non-null   object
 1   Code                                       5155 non-null   object
 2   Year                                       5208 non-null   int64
 3   Total GHG emissions including LUCF (CAIT)  5208 non-null   float64
dtypes: float64(1), int64(1), object(2)
memory usage: 162.9+ KB

In [33]:
emis_df["Entity"].nunique()

193

In [29]:
country_df = pd.read_csv("./Data/country.csv")
country_df.head(20)

,Continent_Name,Continent_Code,Country_Name,Two_Letter_Country_Code,Three_Letter_Country_Code,Country_Number
0,Asia,AS,"Afghanistan, Islamic Republic of",AF,AFG,4.0
1,Europe,EU,"Albania, Republic of",AL,ALB,8.0
2,Antarctica,AN,Antarctica (the territory South of 60 deg S),AQ,ATA,10.0
3,Africa,AF,"Algeria, People's Democratic Republic of",DZ,DZA,12.0
4,Oceania,OC,American Samoa,AS,ASM,16.0
5,Europe,EU,"Andorra, Principality of",AD,AND,20.0
6,Africa,AF,"Angola, Republic of",AO,AGO,24.0
7,North America,NaN,Antigua and Barbuda,AG,ATG,28.0
8,Europe,EU,"Azerbaijan, Republic of",AZ,AZE,31.0
9,Asia,AS,"Azerbaijan, Republic of",AZ,AZE,31.0
10,South America,SA,"Argentina, Argentine Republic",AR,ARG,32.0
11,Oceania,OC,"Australia, Commonwealth of",AU,AUS,36.0
12,Europe,EU,"Austria, Republic of",AT,AUT,40.0
13,North America,NaN,"Bahamas, Commonwealth of the",BS,BHS,44.0
14,Asia,AS,"Bahrain, Kingdom of",BH,BHR,48.0
15,Asia,AS,"Bangladesh, People's Republic of",BD,BGD,50.0
16,Europe,EU,"Armenia, Republic of",AM,ARM,51.0
17,Asia,AS,"Armenia, Republic of",AM,ARM,51.0
18,North America,NaN,Barbados,BB,BRB,52.0
19,Europe,EU,"Belgium, Kingdom of",BE,BEL,56.0

In [28]:
country_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 262 entries, 0 to 261
Data columns (total 6 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Continent_Name             262 non-null    object
 1   Continent_Code             219 non-null    object
 2   Country_Name               262 non-null    object
 3   Two_Letter_Country_Code    261 non-null    object
 4   Three_Letter_Country_Code  258 non-null    object
 5   Country_Number             258 non-null    float64
dtypes: float64(1), object(5)
memory usage: 12.4+ KB

In [36]:
country_df["Country_Name"].nunique()

254

In [37]:
population_df = pd.read_csv("./Data/PopulationDensity.csv")
population_df.head(20)

,Entity,Code,Year,Population density (people per sq. km of land area)
0,Afghanistan,AFG,1961,14.040934
1,Afghanistan,AFG,1962,14.315271
2,Afghanistan,AFG,1963,14.603367
3,Afghanistan,AFG,1964,14.905739
4,Afghanistan,AFG,1965,15.222887
5,Afghanistan,AFG,1966,15.550548
6,Afghanistan,AFG,1967,15.887985
7,Afghanistan,AFG,1968,16.242910
8,Afghanistan,AFG,1969,16.625966
9,Afghanistan,AFG,1970,17.042127
10,Afghanistan,AFG,1971,17.488933
11,Afghanistan,AFG,1972,17.954753
12,Afghanistan,AFG,1973,18.423279
13,Afghanistan,AFG,1974,18.873175
14,Afghanistan,AFG,1975,19.284818
15,Afghanistan,AFG,1976,19.667768
16,Afghanistan,AFG,1977,20.015835
17,Afghanistan,AFG,1978,20.276528
18,Afghanistan,AFG,1979,20.382157
19,Afghanistan,AFG,1980,20.292819

In [38]:
population_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14600 entries, 0 to 14599
Data columns (total 4 columns):
 #   Column                                               Non-Null Count  Dtype
---  ------                                               --------------  -----
 0   Entity                                               14600 non-null  object
 1   Code                                                 11978 non-null  object
 2   Year                                                 14600 non-null  int64
 3   Population density (people per sq. km of land area)  14600 non-null  float64
dtypes: float64(1), int64(1), object(2)
memory usage: 456.4+ KB

In [ ]:
population_df["Entity"].nunique

In [16]:
t = pd.to_datetime(temp_df["dt"])
temp_df_truncated = temp_df[t.dt.year > 1989]
temp_df_truncated.shape

(1000350, 7)

In [18]:
temp_df_truncated.head(20)

,dt,AverageTemperature,AverageTemperatureUncertainty,City,Country,Latitude,Longitude
2954,1990-01-01,4.267,0.459,Århus,Denmark,57.05N,10.33E
2955,1990-02-01,5.895,0.460,Århus,Denmark,57.05N,10.33E
2956,1990-03-01,6.565,0.299,Århus,Denmark,57.05N,10.33E
2957,1990-04-01,8.068,0.222,Århus,Denmark,57.05N,10.33E
2958,1990-05-01,12.944,0.287,Århus,Denmark,57.05N,10.33E
2959,1990-06-01,15.672,0.403,Århus,Denmark,57.05N,10.33E
2960,1990-07-01,16.844,0.319,Århus,Denmark,57.05N,10.33E
2961,1990-08-01,17.402,0.208,Århus,Denmark,57.05N,10.33E
2962,1990-09-01,12.446,0.393,Århus,Denmark,57.05N,10.33E
2963,1990-10-01,9.409,0.240,Århus,Denmark,57.05N,10.33E
2964,1990-11-01,4.027,0.393,Århus,Denmark,57.05N,10.33E
2965,1990-12-01,2.547,0.277,Århus,Denmark,57.05N,10.33E
2966,1991-01-01,2.088,0.383,Århus,Denmark,57.05N,10.33E
2967,1991-02-01,-0.714,0.192,Århus,Denmark,57.05N,10.33E
2968,1991-03-01,4.386,0.341,Århus,Denmark,57.05N,10.33E
2969,1991-04-01,6.804,0.164,Århus,Denmark,57.05N,10.33E
2970,1991-05-01,10.335,0.164,Århus,Denmark,57.05N,10.33E
2971,1991-06-01,12.632,0.265,Århus,Denmark,57.05N,10.33E
2972,1991-07-01,18.301,0.219,Århus,Denmark,57.05N,10.33E
2973,1991-08-01,17.506,0.227,Århus,Denmark,57.05N,10.33E